## Plan Result (prod_backend_database)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_postgresql_flexible_server_active_directory_administrator.db_admin
* Replace
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;crime-portal&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_postgresql_flexible_server_active_directory_administrator.db_admin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "db_admin" {
      + id                  = (known after apply)
      + object_id           = "4a1df01a-0aef-46f9-8515-db7cda151874"
      + principal_name      = "DTS Crime Portal DB Admin (env:production)"
      + principal_type      = "Group"
      + resource_group_name = "crime-portal-rg-prod"
      + server_name         = "crime-portal-postgresql-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "crime-portal-postgresql-prod.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/crime-portal-postgresql-prod" -> (known after apply)
        name                          = "crime-portal-postgresql-prod"
      ~ public_network_access_enabled = false -> (known after apply)
        tags                          = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ version                       = "14" -> "15" # forces replacement
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/crime-portal-postgresql-prod/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/crime-portal-postgresql-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["crime-portal"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/crime-portal-postgresql-prod/databases/crime-portal" -> (known after apply)
        name      = "crime-portal"
      ~ server_id = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/crime-portal-postgresql-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":28,"Program":"tfcmt","SHA1":"","Target":"prod_backend_database","Vars":{}} -->